Revit 2026 API

# UIDocument Constructor

---

Use a database level Document to construct a UI-level Document.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UIDocument(
	Document document
)
```
```vb
Public Sub New (
	document As Document
)
```
```cpp
public:
UIDocument(
	Document^ document
)
```
```fsharp
new :
        document : Document -> UIDocument
```

#### Parameters

document Document
     The database level document.

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a primary document, it is a linked document. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

UIDocument Class

Autodesk.Revit.UI Namespace